Revit 2026 API
FamilyItemFactory.NewExtrusion Method
Add a new Extrusion instance into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Extrusion NewExtrusion(
	bool isSolid,
	CurveArrArray profile,
	SketchPlane sketchPlane,
	double end
)
Public Function NewExtrusion (
	isSolid As Boolean,
	profile As CurveArrArray,
	sketchPlane As SketchPlane,
	end As Double
) As Extrusion
public:
Extrusion^ NewExtrusion(
	bool isSolid,
	CurveArrArray^ profile,
	SketchPlane^ sketchPlane,
	double end
)
member NewExtrusion :
        isSolid : bool *
        profile : CurveArrArray *
        sketchPlane : SketchPlane *
        end : float -> Extrusion
Parameters
isSolid Boolean
Indicates if the Extrusion is Solid or Void.
profile CurveArrArray
The profile of the newly created Extrusion. This may contain more than one curve loop. Each loop must be a fully closed curve loop and the loops may not intersect. All input curves must lie in the same plane. The loop can be a unbound circle or ellipse, but its geometry will be split in two in order to satisfy requirements for sketches used in extrusions.
sketchPlane SketchPlane
The sketch plane for the extrusion. The direction of extrusion is determined by the normal for the sketch plane. To extrude in the other direction set the end value to negative.
end Double
The length of the extrusion.
Return Value
Extrusion
If creation was successful the new Extrusion is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the input argument-profile-is null or empty array.
ArgumentNullException |  Thrown when the input argument-sketchPlane-is null.
ArgumentException |  Thrown when the input argument-sketchPlane-is an invalid sketch plane.
InvalidOperationException |  Thrown when the creation failed.
Remarks
This method creates an extrusion in a family document. The extrusion will be extended perpendicular to the sketch plane of the extrusion profile.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace